# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_container_registry.altinncr: Reading...
data.azurerm_container_registry.altinncr: Read complete after 1s [id=/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.grafana_altinn_cloud_ingressroute will be created
  + resource "kubectl_manifest" "grafana_altinn_cloud_ingressroute" {
      + api_version             = "traefik.io/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "IngressRoute"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "redirect-to-central-grafana"
      + namespace               = "traefik"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: traefik.io/v1alpha1
            kind: IngressRoute
            metadata:
              name: redirect-to-central-grafana
              namespace: traefik
            spec:
              entryPoints:
              - https
              routes:
              - kind: Rule
                match: Host(grafana.altinn.cloud) || Host(dev.grafana.altinn.cloud) && PathPrefix(/)
                middlewares:
                - name: redirect-to-central-grafana
                  namespace: traefik
                services:
                - kind: TraefikService
                  name: noop@internal
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.grafana_altinn_cloud_middleware will be created
  + resource "kubectl_manifest" "grafana_altinn_cloud_middleware" {
      + api_version             = "traefik.io/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Middleware"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "redirect-to-central-grafana"
      + namespace               = "traefik"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: traefik.io/v1alpha1
            kind: Middleware
            metadata:
              name: redirect-to-central-grafana
              namespace: traefik
            spec:
              redirectRegex:
                permanent: true
                regex: ^http(|s)://(.*)grafana.(.*)altinn.(no|cloud)(.*)
                replacement: https://altinn-grafana-test-b2b8dpdkcvfuhfd3.eno.grafana.azure.com5
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @bengtfredh |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/admin-test-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/admin-test-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_admin-test-aks-rg.tfstate.tfplan`